{
  "categories": {
    "light": [
      { "id": 1, "question": "What's a small thing that made you smile today?" },
      { "id": 2, "question": "If you could eat one meal for the rest of your life, what would it be?" },
      { "id": 3, "question": "What song is stuck in your head right now?" },
      { "id": 4, "question": "What's the most random thing you've searched on the internet recently?" },
      { "id": 5, "question": "If you could have any superpower just for today, what would it be?" },
      { "id": 6, "question": "What's your current favorite comfort show or movie?" },
      { "id": 7, "question": "If you could master any skill instantly, what would you choose?" },
      { "id": 8, "question": "What's the weirdest food combination you secretly enjoy?" },
      { "id": 9, "question": "If you were a character in a sitcom, which one would you be?" },
      { "id": 10, "question": "What's something small that always makes your day better?" },
      { "id": 11, "question": "If you could live in any fictional world for a week, where would you go?" },
      { "id": 12, "question": "What's the last thing that made you laugh out loud?" },
      { "id": 13, "question": "If you had to describe your mood as a weather pattern, what would it be today?" },
      { "id": 14, "question": "What's a hobby you've always wanted to try but haven't yet?" },
      { "id": 15, "question": "If you could have dinner with any celebrity, who would you pick?" },
      { "id": 16, "question": "What's your go-to karaoke song?" },
      { "id": 17, "question": "If you could instantly be fluent in any language, which would you choose?" },
      { "id": 18, "question": "What's the best compliment you've received recently?" },
      { "id": 19, "question": "If your life had a theme song, what would it be?" },
      { "id": 20, "question": "What's something you're looking forward to this week?" }
    ],
    "memories": [
      { "id": 21, "question": "What's your favorite memory of us together?" },
      { "id": 22, "question": "When did you first realize you had feelings for me?" },
      { "id": 23, "question": "What's your favorite thing I've ever said to you?" },
      { "id": 24, "question": "What moment in our relationship made you feel most loved?" },
      { "id": 25, "question": "What's a small moment with us that you think about often?" },
      { "id": 26, "question": "What's your favorite trip or adventure we've had together?" },
      { "id": 27, "question": "What was going through your mind on our first date?" },
      { "id": 28, "question": "What's a challenge we overcame together that you're proud of?" },
      { "id": 29, "question": "What's your favorite photo of us and why?" },
      { "id": 30, "question": "What's a funny moment from our relationship that still makes you laugh?" },
      { "id": 31, "question": "What's a time I surprised you in a good way?" },
      { "id": 32, "question": "What's your favorite meal we've shared together?" },
      { "id": 33, "question": "When did you feel the most connected to me?" },
      { "id": 34, "question": "What's a song that reminds you of us?" },
      { "id": 35, "question": "What's your favorite text or message I've ever sent you?" },
      { "id": 36, "question": "What's a tradition of ours that you cherish?" },
      { "id": 37, "question": "What's something we did together that you'd love to do again?" },
      { "id": 38, "question": "What's your favorite thing about how we met?" },
      { "id": 39, "question": "What was a turning point in our relationship?" },
      { "id": 40, "question": "What's a memory with us that feels like a movie scene?" }
    ],
    "future": [
      { "id": 41, "question": "Where do you see us in 5 years?" },
      { "id": 42, "question": "What's a trip you'd love for us to take together someday?" },
      { "id": 43, "question": "What does your ideal day with me look like in the future?" },
      { "id": 44, "question": "What's a life goal you want us to achieve together?" },
      { "id": 45, "question": "If we could live anywhere in the world together, where would it be?" },
      { "id": 46, "question": "What's a tradition you'd like us to start?" },
      { "id": 47, "question": "What's something you're excited to experience with me for the first time?" },
      { "id": 48, "question": "What does 'home' mean to you when you think about our future?" },
      { "id": 49, "question": "What's a skill you'd like us to learn together?" },
      { "id": 50, "question": "How do you imagine our morning routine when we live together?" },
      { "id": 51, "question": "What's a dream date you want us to have someday?" },
      { "id": 52, "question": "What's something you hope never changes about us?" },
      { "id": 53, "question": "What kind of adventures do you want us to have when we're old?" },
      { "id": 54, "question": "What's a movie or book ending that you'd want for our love story?" },
      { "id": 55, "question": "What's one thing you want to accomplish before our next reunion?" },
      { "id": 56, "question": "What holiday tradition would you like to create with me?" },
      { "id": 57, "question": "If we wrote a bucket list together, what would be the first item?" },
      { "id": 58, "question": "What's something you daydream about regarding our future?" },
      { "id": 59, "question": "How do you imagine we'll celebrate our anniversary years from now?" },
      { "id": 60, "question": "What's a fear about the future that you'd like us to face together?" }
    ],
    "gratitude": [
      { "id": 61, "question": "What's something about me you're grateful for?" },
      { "id": 62, "question": "How has being with me changed you for the better?" },
      { "id": 63, "question": "What's something I do that you appreciate but have never told me?" },
      { "id": 64, "question": "What's your favorite quality about me?" },
      { "id": 65, "question": "What's something I said that you'll never forget?" },
      { "id": 66, "question": "How do I make you feel supported?" },
      { "id": 67, "question": "What's a way I've helped you grow as a person?" },
      { "id": 68, "question": "What's something you admire about how I handle challenges?" },
      { "id": 69, "question": "What's a time I was there for you when you really needed it?" },
      { "id": 70, "question": "What do you love most about our conversations?" },
      { "id": 71, "question": "What's something I do that always makes you feel loved?" },
      { "id": 72, "question": "How do I make the distance feel easier?" },
      { "id": 73, "question": "What's a sacrifice I've made that you're thankful for?" },
      { "id": 74, "question": "What's your favorite way I show affection?" },
      { "id": 75, "question": "What's something about our relationship that others might not understand but you cherish?" },
      { "id": 76, "question": "How have I surprised you in our relationship?" },
      { "id": 77, "question": "What's something I believe in you about that means a lot?" },
      { "id": 78, "question": "What's a small gesture I do that has a big impact on you?" },
      { "id": 79, "question": "What do you appreciate about how we communicate?" },
      { "id": 80, "question": "What makes you grateful to have me as your partner?" }
    ]
  }
}
